tap "azure/azd"
tap "azure/functions"
tap "databricks/tap"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "microsoft/mssql-release"
# New file format for still image compression
brew "jpeg-xl"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bring your existing Azure resources under the management of Terraform
brew "aztfexport"
# YAML Parser
brew "libyaml"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Core application library for C
brew "glib"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# GNU File, Shell, and Text utilities
brew "coreutils"
# .NET Core
brew "dotnet"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# GitHub command-line tool
brew "gh"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Easy way to access the system keyring service from python
brew "keyring"
# X.509 and CMS library
brew "libksba"
# LLVM's OpenMP runtime library
brew "libomp"
# Postgres C API library
brew "libpq", link: true
# Development kit for the Java programming language
brew "openjdk@21"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Python package management tool
brew "poetry"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Code-search similar to ack
brew "the_silver_searcher"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# Azure Developer CLI
brew "azure/azd/azd"
# Command-line interface for the Databricks platform
brew "databricks/tap/databricks"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql17"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# File system integration
cask "macfuse"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Command-line shell and scripting language
cask "powershell"
